app/controllers/api/v1/climates_controller.rb

SELECT "climates".* FROM "climates" ORDER BY created_at DESC
---
    def index
      @climates = Climate.all

INSERT INTO "climates" ("town", "temperature", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["town", "1"], ["temperature", 2], ["status", "3"], ["created_at", "2018-04-06 02:54:39.957509"], ["updated_at", "2018-04-06 02:54:39.957509"]]
---
    def create
  		@climate = Climate.create(climate_params)